/*
Задача 38: Задайте массив вещественных чисел. Найдите разницу между максимальным и минимальным элементов массива.
[3 7 22 2 78] -> 76
*/

double GetDiff(double[] array)
{

}

double[] array = new double[] {2.5, 3.2, 9.9, -4.7};
double differece = GetDiff(array);

Console.WriteLine($"Разница между максимальным и минимальным элементами: {difference}");
